[
    {
        "title": "Portfolio Website",
        "year": 2025,
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "A personal website to showcase projects, resume, and contact information."
    },
    {
        "title": "Movie Recommendation System",
        "year": 2024,
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "A machine learning model to recommend movies based on user preferences."
    },
    {
        "title": "Budget Manager",
        "year": 2024,
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "A simple application to help users track their expenses and savings over time."
    },
    {
        "title": "Tic-Tac-Toe",
        "year": 2024,
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Created a two-player Tic-Tac-Toe game. Designed a simple interface and implemented logic to determine the winner or a draw."
    },
    {
        "title": "Evaluating the Relationship Between the Amount of Protein and Average Rating of Recipes",
        "year": 2024,
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "This data science project explores the relationship between the protein content of recipes and their average ratings. Using datasets from food.com containing recipe details and user ratings since 2008, this analysis investigates whether high-protein recipes are rated higher due to their perceived health benefits."
    },
    {
        "title": "To-Do List App",
        "year": 2023,
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "A mobile app that allows users to create, organize, and manage tasks with notification reminders."
    },
    {
        "title": "Analyzing the Impact of Movie Budgets on Audience and Critic Ratings: A Study of Best Picture Winners",
        "year": 2023,
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Analyzing the Impact of Movie Budgets on Audience and Critic Ratings: A Study of Best Picture Winners."
    },
    {
        "title": "Predicting Movie Genres Based on Plot Summaries",
        "year": 2023,
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Used machine learning models to classify movies into genres based on their plot summaries. Trained the model using a dataset of movies with labeled genres."
    },
    {
        "title": "Nightcrawler Chatbot",
        "year": 2022,
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "A conversational chatbot built to provide detailed information about the movie Nightcrawler. Users can interact with the bot by asking questions about the movie's release date, genre, plot, fun facts, box office performance, cast, director, and more. The chatbot mimics natural human conversation, offering responses as if texting with a friend."
    },
    {
        "title": "Basic Calculator",
        "year": 2022,
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Developed a calculator for basic arithmetic operations."
    },
    {
        "title": "GPA Calculator",
        "year": 2022,
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Built a tool to calculate semester and cumulative GPAs based on user input for grades and credit hours."
    },
    {
        "title": "Grade Calculator",
        "year": 2021,
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Designed a tool that calculates final grades based on assignment weights and grades entered by the user."
    },
    {
        "title": "Bike Watching in Boston",
        "year": 2025,
        "image": "../images/bikewatching.png",
        "description": "Designed an interactive visualization about the bike stations and their traffic in the Boston area.",
        "url": "https://reemas03.github.io/bikewatching/"
    }
]
